// #include <stdio.h>
// int main()
// {
//     // int a = 3;
//     // int b = -5;
//     // int c = a & b;
//     // //& 都为 1 则为 1，其他情况为 0
//     // //|，有一个为 1 则为 1
//     // //^，相同为 0，不相同则为 1
//     // printf("%d\n", c);
//     // // 3的源码      00000000000000000000000000000011
//     // /// 补码         00000000000000000000000000000011
//     // //-5 的源码     10000000000000000000000000000101
//     // //-5的补码      11111111111111111111111111111011
//     // // 按位与之后的结果00000000000000000000000000000011
//     // // 输出则为 3

//     // // 按位与的结果

//     // 求一个数在计算机中的补码的 1 的个数
//     // int a = 7866;
//     // int i = 0;
//     // int count = 0;
//     // for (i = 0; i < 32; i++)
//     // {
//     //     if (a & 1)
//     //     {
//     //         count += 1;
//     //     }
//     //     a = a >> 1;
//     // }
//     // printf("%d\n", count);
//     // return 0;

// }

#include <stdio.h>

int main()
{
    // int a = 13;        // 13 的二进制表示: 00000000000000000000000000001101
    // a |= (1 << 4);     // 1 左移 4 位后，与 a 进行按位或运算
    // printf("%d\n", a); // 输出 a 的新值

    // a &= (~(1 << 4));
    // printf("%d\n", a);
    int a = 3.14;
    printf("%d\n", a);
    printf("%lu\n", sizeof a);
    printf("%lu\n", sizeof(int));
    // printf("%d\n",sizeof int);括号的作用是类型转换，可以去掉。    sizeof 不是一个函数，而是一个操作符

    return 0;
}